In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import missingno as msn

In [2]:
df = pd.read_csv('Bengaluru_House_Data.csv')
pd.set_option('display.max_columns',None)

In [3]:
df.head(2)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 624.4+ KB

In [5]:
df.describe(include='all')

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
count,13320,13320,13319,13304,7818,13320,13247.000000,12711.000000,13320.000000
unique,4,81,1305,31,2688,2117,NaN,NaN,NaN
top,Super built-up Area,Ready To Move,Whitefield,2 BHK,GrrvaGr,1200,NaN,NaN,NaN
freq,8790,10581,540,5199,80,843,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,2.692610,1.584376,112.565627
std,NaN,NaN,NaN,NaN,NaN,NaN,1.341458,0.817263,148.971674
min,NaN,NaN,NaN,NaN,NaN,NaN,1.000000,0.000000,8.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,2.000000,1.000000,50.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,2.000000,2.000000,72.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,3.000000,2.000000,120.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,40.000000,3.000000,3600.000000

In [6]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [7]:
# since society have lot of nulls and it is not importnant as much (common sense) it should be removed 
# one location and 16 size values have missed so we drop those nun values row wise (data set is so big)

In [8]:
dfs = df.copy()
dfs.drop('society',axis=1,inplace=True)

In [9]:
dfs.columns

Index(['area_type', 'availability', 'location', 'size', 'total_sqft', 'bath',
       'balcony', 'price'],
      dtype='object')

In [10]:
dfs.dropna(subset=['location','size'],inplace=True)

In [11]:
dfs.isnull().sum()

area_type         0
availability      0
location          0
size              0
total_sqft        0
bath             57
balcony         593
price             0
dtype: int64

In [12]:
dfs['bath'].value_counts()

2.0     6908
3.0     3285
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
18.0       1
40.0       1
15.0       1
14.0       1
Name: bath, dtype: int64

In [13]:
dfs['bath'].fillna(2.0,inplace=True)

In [14]:
dfs.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13303 entries, 0 to 13319
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13303 non-null  object
 1   availability  13303 non-null  object
 2   location      13303 non-null  object
 3   size          13303 non-null  object
 4   total_sqft    13303 non-null  object
 5   bath          13303 non-null  float64
 6   balcony       12710 non-null  float64
 7   price         13303 non-null  float64
dtypes: float64(3), object(5)
memory usage: 675.5+ KB

In [15]:
dfs['balcony'].value_counts()

2.0    5112
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64

In [16]:
# it is seems to hard to use mode value to replace nun

In [17]:
dfs.corr()

             bath   balcony     price
bath     1.000000  0.204191  0.454691
balcony  0.204191  1.000000  0.120363
price    0.454691  0.120363  1.000000

In [18]:
# there is not a significant relationship with balacony

In [19]:
dfs['balcony'].fillna(dfs['balcony'].median(),inplace=True)

In [20]:
dfs.head(3)

,area_type,availability,location,size,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,1440,2.0,3.0,62.00

In [21]:
dfs['size']

0            2 BHK
1        4 Bedroom
2            3 BHK
3            3 BHK
4            2 BHK
           ...
13315    5 Bedroom
13316        4 BHK
13317        2 BHK
13318        4 BHK
13319        1 BHK
Name: size, Length: 13303, dtype: object

In [22]:
dfs['size'] = dfs['size'].apply(lambda x : x.split(" ")[0]).astype(int)

In [23]:
dfs.head(3)

,area_type,availability,location,size,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3,1440,2.0,3.0,62.00

In [24]:
dfs.corr()

             size      bath   balcony     price
size     1.000000  0.895752  0.194796  0.398295
bath     0.895752  1.000000  0.208333  0.454691
balcony  0.194796  0.208333  1.000000  0.125093
price    0.398295  0.454691  0.125093  1.000000

In [25]:
dfs.isnull().sum()

area_type       0
availability    0
location        0
size            0
total_sqft      0
bath            0
balcony         0
price           0
dtype: int64

In [26]:
dfs.location.value_counts()

Whitefield                               539
Sarjapur  Road                           397
Electronic City                          302
Kanakpura Road                           273
Thanisandra                              234
                                        ...
Sabari Nagar                               1
D Souza Layout                             1
Near Electronic City,                      1
manyata tech park                          1
Bidere Agarahara, Behind Safal market      1
Name: location, Length: 1304, dtype: int64

In [27]:
# location looks like not much effctive so i gonna drop it

In [28]:
dfs.drop('location',axis=1,inplace=True)

In [29]:
dfs.head(2)

              area_type   availability  size total_sqft  bath  balcony   price
0  Super built-up  Area         19-Dec     2       1056   2.0      1.0   39.07
1            Plot  Area  Ready To Move     4       2600   5.0      3.0  120.00

In [30]:
dfs.availability.value_counts()

Ready To Move    10580
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
16-Nov               1
14-Nov               1
16-Oct               1
17-Jan               1
16-Jan               1
Name: availability, Length: 80, dtype: int64

In [34]:
dfs['availability'].replace(['Ready To Move'],[1],inplace=True)

In [35]:
dfs.availability.value_counts()

1         10580
18-Dec      307
18-May      295
18-Apr      271
18-Aug      200
          ...
14-Nov        1
16-Oct        1
17-Jan        1
16-Jan        1
15-Aug        1
Name: availability, Length: 80, dtype: int64

In [36]:
dfs['availability'] = np.where(dfs['availability']==1,1,0)

In [37]:
dfs.availability.value_counts()

1    10580
0     2723
Name: availability, dtype: int64

In [38]:
dfs['availability'] = dfs['availability'].astype(int)

In [39]:
dfs.head(2)

              area_type  availability  size total_sqft  bath  balcony   price
0  Super built-up  Area             0     2       1056   2.0      1.0   39.07
1            Plot  Area             1     4       2600   5.0      3.0  120.00

In [40]:
dfs['area_type'].value_counts()

Super built-up  Area    8789
Built-up  Area          2418
Plot  Area              2009
Carpet  Area              87
Name: area_type, dtype: int64

In [41]:
dict = {'Super built-up  Area': 1,'Built-up  Area': 2,'Plot  Area': 3,'Carpet  Area': 4 }

In [42]:
dfs['area_type'] = dfs['area_type'].map(dict)

In [43]:
dfs.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13303 entries, 0 to 13319
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13303 non-null  int64
 1   availability  13303 non-null  int32
 2   size          13303 non-null  int32
 3   total_sqft    13303 non-null  object
 4   bath          13303 non-null  float64
 5   balcony       13303 non-null  float64
 6   price         13303 non-null  float64
dtypes: float64(3), int32(2), int64(1), object(1)
memory usage: 675.5+ KB